{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 1 수학의 기초 개념"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1.1 집합과 사상"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1.1.1 집합이란?"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "수학에서는 '사물의 모임'을 고려하는 것이 모든 것의 출발점이다. 예를 들면, 모든 사람들이 잘 아는 자연수는 다음과 같이 양(+)의 정수를 모아 놓은 것이다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "\\textbf{N} = \\{1,\\ 2,\\ 3,\\ \\cdots\\}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "이와 같이 사물을 모아 놓은 것을 **집합**이라고 부른다. 집합에 포함되는 각각의 사물을 **원소**라고 한다. 집합을 나타낼 때는 일반적으로 각각의 원소를 { }로 묶어서 나열한다. 위에 나온 $\\textbf{N}$은 자연수의 집합을 나타낼 때 사용하는 기호다. 물론 숫자를 모아 놓은 것만 집합이라고 부르는 것은 아니다. '사과 열 개를 모아 놓은 집합'도 수학에서 다룰 수 있는 훌륭한 집합이다. 수학적으로 표현하면 다음과 같다. $A$는 이 집합에 붙여진 이름이다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "A = \\{\\text{사과1},\\ \\text{사과2},\\ \\cdots,\\ \\text{사과10} \\}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "그러면 자연수의 집합 $\\textbf{N}$과 사과의 집합 $A$에는 어떤 차이가 있을까? 집합에 포함되는 원소의 개수도 물론 다르지만, 그것보다 더 큰 차이는 자연수는 대소 관계에 의해 각각의 원소의 순서가 매겨져 있다는 점이다. 이와 같이 대소 관계로 일렬로 배열할 수 있는 집합을 **순서집합**이라고 부른다. 물론 사과에도 무언가 대소 관계를 정의해 일렬로 늘어놓을 수 있지만, 크기로 판단할지 무게로 판단할지 대소 관계의 판단 기준에 임의성이 있다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "일반적으로 수학에서 집합이라고 하면 대소 관계와 순서 매기기가 특별히 정해지지 않았다고 생각하면 된다. 자연수와 같이 순서 관계가 잘 알려져 있는 것은 당연히 순서집합으로 다루지만, 순수한 사물을 모아 놓은 집합을 다루는 경우에는 순서집합과 같이 추가 구조를 포함해 고려하는 경우와 명확하게 구별하는 것이 중요하다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "일반적으로 집합을 표현할 때는 알파벳 대문자 $A,\\ B,\\ C$ 등을 사용한다. 또한, 자연수와 정수 등 대표적인 숫자의 집합은 다음 기호들을 사용한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- 자연수: $\\textbf{N} = \\{1,\\ 2,\\ 3,\\ \\cdots\\}$\n",
    "- 정수: $\\textbf{Z} = \\{0,\\ \\pm1,\\ \\pm2,\\ \\cdots\\}$\n",
    "- 유리수: $\\textbf{Q}$\n",
    "- 실수: $\\textbf{R}$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "이 기호들은 위에서부터 순서대로 Natural Number, Zahlen(독일어로 '수'를 의미한다), Quotient(영어로 나눗셈의 몫을 의미한다), Real Number의 첫머리에 오는 문자를 취한 것이다. 이때 자연수 $\\textbf{N}$은 정수 $\\textbf{Z}$에 포함되며, 더 나아가 정수 $\\textbf{Z}$는 유리수 $\\textbf{Q}$에 포함되는 등 포함 관계가 성립되는 것을 알 수 있다. 이와 같은 포함 관계는 다음 기호로 표시한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "\\textbf{N} \\subset \\textbf{Z} \\subset \\textbf{Q} \\subset \\textbf{R}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "또 어떤 원소 $x$가 집합 $A$에 포함되는 것을 다음과 같이 표시한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "x \\in A\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$\\in$은 Element(원소)의 'E'에서 만들어진 기호다. 이와 반대로 원소 $x$가 집합 $A$에 포함되지 않는 경우는 다음과 같이 표시한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "x \\notin A\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "또한, 집합을 표시할 때 단순히 집합의 원소를 늘어놓지 않고도 원소가 만족하는 모든 조건을 표시할 수 있다('내포 표현을 읽는 방법' Note 참조). 예를 들어 다음은 자연수 $\\textbf{N}$의 원소 중에서 2로 나눈 나머지가 0인 수를 모아 놓은 집합, 즉 짝수의 집합을 표시한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "\\textbf{N}_0 = \\{n\\ |\\ n \\in \\textbf{N},\\ n\\%2 = 0\\} \\tag{1-1}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "여기서 $n\\ \\%\\ 2$는 자연수 $n$을 2로 나눈 나머지를 표현하는 기호다. 마찬가지로 홀수의 집합은 다음과 같이 표현할 수 있다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "\\textbf{N}_1 = \\{n\\ |\\ n \\in \\textbf{N},\\ n\\%2 = 1\\}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "또는 짝수, 홀수의 집합을 다음과 같이 표현할 수도 있다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\\begin{align}\n",
    "  \\begin{split}\n",
    "\t  \\textbf{N}_0 &= \\{2n\\ |\\ n \\in \\textbf{N}\\}\\\\\n",
    "    \\textbf{N}_1 &= \\{2n - 1\\ |\\ n \\in \\textbf{N}\\}\n",
    "  \\end{split}\\tag{1-2}\n",
    "\\end{align}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "이와 같이 집합 요소가 만족시켜야 하는 성질을 표시하는 것으로 집합을 정의하는 방법을 **내포적 정의**라고 하며, 처음에 나온 사과의 예와 같이 집합에 포함된 원소를 그냥 나열해 정의하는 방법을 **외연적 정의**라고 한다. 여기서 나중에 사용할 0 이상인 실수의 집합을 $\\textbf{R}_+$를 다음과 같이 정의하겠다. 이것도 내포적 정의의 예다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "\\textbf{R}_+ = \\{x\\ |\\ x \\in \\textbf{R},\\ x \\geq 0\\}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---\n",
    "\n",
    "Note $\\equiv$ **내포 표현을 읽는 방법**\n",
    "\n",
    "집합의 내포적 정의에 이용하는 표기법을 내포 표현이라고 한다. 집합의 내포 표현에서 수직선 좌측에는 변수를 이용한 수식을 표시하고, 수직선 우측에는 수식에 포함된 변수가 만족하는 조건을 표시한다. 본문 (1-1)의 에에서 수직선 우측에는 '$n$은 자연수, 또한 2로 나눈 나머지가 0'이라는 조건이 있다. 그리고 수직선 좌측에는 $n$ 그 자체가 놓여 있어서 '이 조건을 만족하는 $n$을 모두 모아 놓은 집합'(즉, 짝수 전체의 집합)이 된다. 한편 (1-2)의 경우, 수직선 우측에는 '$n$은 자연수'라는 조건이 있지만, 수직선 좌측에는 '$2n$'이라는 수식이 있다. 이러한 표현(즉, 조건과 수식을 모두 합해 표현한 것)은 '$n$을 자연수로 할 때 $2n$으로 계산되는 값을 모두 모아 놓은 집합'(즉, 짝수 전체의 집합)을 만든다. 이와 같이 같은 집합이라고 여러 가지 표현을 선택할 수 있는 것이 내포 표현의 특징 중 하나다.\n",
    "\n",
    "\n",
    "프로그래밍 언어를 알고 있다면, (1-2)의 표현을 봤을 때 변수 $n$에 대한 루프를 떠올릴지도 모르겠다. 즉, $n$ 값을 하나씩 늘리면서 $2n$ 값을 배열에 추가해나가는 조작이다. 단, 지금 예라면 $n$ 값에 끝이 없으므로 이 조작은 무한 루프에 빠진다. 수학의 여러 가지 조작 중에는 절차형 프로그래밍 언어로 간단히 표현할 수 없는 것이 있으므로 주의하자.\n",
    "\n",
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1.1.2 사상이란?"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "계속해서 집합에서 집합으로의 사상을 생각해보자. 느닷없지만 앞서 살펴본 사과의 집합에 포함된 원소 수, 즉 사과의 수는 어떻게 셀 수 있을까? \"끝에서부터 순서대로 세면 되지 않을까?\"라고 생각했다면, 정답이다! 단, '끝에서부터 순서대로 센다'는 작업을 정확하게 표현하기 위해 다음과 같은 그림을 그려봅시다(그림 1-1)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**그림 1-1** 사과 집합에서 자연수 집합으로 향하는 사상의 예"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "마치 사과 집합의 각 원소를 자연수 집합의 원소에 하나씩 연결한 형태다. 자연수는 대소 관계가 있으므로 작은 것부터 차례대로 목적지를 선택한다. 이와 같이 두 집합의 원소끼리 연결하는 것이 '사상'이다. 더 정확하게는 연결하는 방법을 정하는 룰이라고 말할 수 있다. '수를 센다'는 작업을 수학적으로는 '수를 세는 대상의 집합에서 순서집합인 자연수로의 사상을 정의한다'는 것으로 인식할 수 있다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "여기서 수학의 사상에서는 어떤 집합의 원소에서 어떤 집합의 원소로 향할지를 나타내는 방향이 결정되어 있다는 점에 주의해야 한다. 더 나아가 원소끼리 연결시키는 방법에는 자유도가 있다. 그림 1-2(a)는 자연수를 하나씩 건너뛰어서 연결하는 예다. 또는 그림 1-2(b)와 같이 사과 여러 개를 똑같은 자연수에 연결할 수도 있다. 모두 양의 사상 예다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**그림 1-2** 사과 집합에서 자연수 집합으로의 사상 중 그림1-1 이외의 예"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**그림 1-3** 허용되지 않는 사상의 예"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "한편 그림 1-3과 같이 사과 하나가 자연수 여러 개에 연결되는 것은 허용되지 않는다. 수학의 사상에서 원소 하나의 목적지는 반드시 하나로 결정되어야 한다. 예를 들어 $f(x) = x^2$이라는 함수라면 $x = \\pm1$에 대해 같은 값 $f(x) = 1$을 반환한다. 그림 1-2(b)에 해당하는 상황이다. 이와 반대로 $x$ 값 하나에 값을 여러 개 내는 것은 안 된다고 생각하면 된다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "또한, 이 예에서 알 수 있듯이 $f(x) = x^2$이라는 함수도 사상의 한 종류다. 이 예는 실수값을 집어넣으면 실숫값이 반환되므로 '실수의 집합'에서 '실수의 집합'으로의 사상이라고 생각할 수 있다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "계속해서 사상에 관한 용어로 **단사**와 **전사**를 알아보자. 우선 그림 1-1이나 그림 1-2(b)와 같이 각 원소의 목적지가 모두 다른 원소인 경우, 이러한 사상을 단사라고 한다. 그림 1-2(b)는 단사가 아닌 예다. 다음으로 목적지의 집합에서 볼 때 모든 원소에 찾아오는 원소가 있는 경우, 이러한 사상을 전사라고 한다. 그림 1-4는 자연수에서 사과로 가는 사상으로, 자연수는 무한하지만 사과는 열 개밖에 없다. 그래서 열 개까지 할당이 끝아면 다시 앞부분으로 돌아가 할당하는 작업을 수행한다. 자연수의 첫 번째 위치에 있는 숫자에 의해 목적지의 사과가 결정된다고도 할 수 있다. 이 경우 자연수 여러 개가 같은 사과를 목적지로 하므로 단사는 아니지만 모든 사과에 연결된 자연수가 있으므로 전사다. 단사이면서 동시에 전사인 사상을 **전단사**라고 한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**그림 1-4** 자연수 집합으로부터 사과 집합으로의 사상"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "그림 1-5는 두 '가족 집합'의 관계로 전사, 단사, 전단사를 표현한 것이다. 그림 1-5(a)는 전단사의 경우로 여러 가지 집합의 원소가 모두 일대일로 대응될 수 있다. 이 예에서 보면 두 가족은 가족 구성이 동일하다는 것을 알 수 있다. 단, 가족 구성이 다른 경우에도 가족의 인원수가 동일하다면 전단사가 가능하므로, '전단사라고 해서 가족 구성이 동일한' 관계가 항상 성립되어야 하는 것은 아니다. 일반적으로 원소의 수가 유한한 집합에서 전단사의 사상이 구성되기 위한 필요충분조건은 여러 가지 원소의 수가 동일한 것이다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**그림 1-5** 가족 A와 가족 B 간의 사상"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "그러면 그림 1-5(b)의 '단사지만 전사가 아닌' 예는 어떤 것일까? 이 경우, 가족 A(자식이 하나인 핵가족)와 동일한 구성이 가족 B(할아버지, 할머니가 살아계신 대가족) 가운데 삽입되어 있다는 사실을 확인할 수 있다. 이 **삽입**이라는 개념은 집합 간의 관계를 연구할 때 자주 등장한다고 기억해두면 돟다. 또한, 그림 1-5(c)도 재미있는 패턴이다. '전사지만 단사가 아닌' 예지만, 적어도 각각의 가족에 3세대의 부모와 자식이 있다는 관계성을 보존하고 있다. 이와 같이 사상을 통해 집합 간의 관계를 생각할 수 있다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "마지막으로 하나 더, 사상에 관한 용어로 **정의역**과 **치역**이 있다. 정의역은 사상에 의해 이동하는 원래 원소의 집합이고, 치역은 사상에 의해 이동되어 간 곳의 원소의 집합이다. 그림 1-1의 예에서 보면 정의역은 사과 집합 A고, 치역은 1~10의 자연수 집합 $\\{1,\\ 2,\\ 3,\\ 4,\\ 5,\\ 6,\\ 7,\\ 8,\\ 9,\\ 10\\}$이다. 11 이상의 숫자는 치겨에 포함되지 않는다는 점을 주의하자. 함수 $f(x) = x^2$의 경우라면 임의의 실수를 0 이상의 실수로 이동하는 함수이므로 정의역은 실수 전체 $\\textbf{R}$이고, 치역은 0 이상의 실수 전체 $\\textbf{R}_+$가 된다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "여기서 사상을 표시하는 기호를 사용해보자. 우선 사상 $f$의 정의역과 치역이 각각 $A$와 $B$인 것을 다음과 같이 표시한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "f:A \\to B \\tag{1-3}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "또한, 정의역과 치역의 각각의 원소에 주목해 $A$의 원소 $a$를 $B$의 원소 $b$로 이동한 경우 다음과 같이 표시한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "f: a \\mapsto b\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "이것을 하나로 정리하면 다음과 같이 표기할 수 있다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "\\begin{matrix}\n",
    "f:A \\to B \\\\\n",
    "\\quad a \\mapsto b\\end{matrix}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "함수 $f(x) = x^2$의 경우라면 실수 전체 $\\textbf{R}$을 0 이상의 실수 전체 $\\textbf{R}_+$로 이동하므로 다음과 같이 표시할 수 있다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    " \\begin{matrix}\n",
    "f: \\textbf{R} \\to \\textbf{R}_+ \\\\\n",
    "\\quad x \\mapsto x^2\\end{matrix}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "그림 1-1의 예에서는 모든 사과에 그 목적지인 자연수가 할당되어 있지만, \"목적지를 갖지 못한 사과가 있는 경우에는 어떻게 될까?\"라고 생각한 사람도 있을 것이다. 그러한 사상을 생각해볼 수도 있지만, 그 경우 '사과의 집합 $A$를 정의역으로 하는 사상'이라고 부르지 못한다. (1-3)과 같이 사상을 표기하는 경우에는 $A$의 모든 원소에 그 목적지가 정해져 있다는 전제가 필요하다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1.1.3 집합의 연산"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "이 절에서는 집합끼리의 연산에 대해 설명한다. 우선 집합 $A$가 집합 $B$에 포함되면 $A$는 $B$의 **부분집합**이라 하고, $A \\subset B$ 혹은 $B \\supset A$라는 기호로 표기한다. 이것을 집합의 **포함 관계**라고 한다. 이는 다시 \"$A$에 속하는 모든 원소는 $B$에도 속한다\"라고 바꿔 말할 수 있다. 이 내용을 논리식으로 표시하면 다음과 같다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "x \\in A \\Rightarrow x \\in B\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "이를 보고 당연하다고 생각했을 수도 있지만, 이 표현은 집합의 표현 관계를 증명할 때 도움이 된다. 어떤 집합 $A$와 $B$에 대해 $A \\in B$인 것을 증명하고 싶은 경우, $A$에 포함되어 있는 임의의 원소 $x$가 반드시 $B$의 원소라는 것을 보여주면 되는 것이다. 또 '원소를 하나도 포함하지 않는 집합'도 집합의 한 종류로 보는데, 이를 **공집합**이라 하고 $\\varnothing$라는 기호로 표시한다. 공집합은 모든 집합의 부분집합으로 여겨진다.[^1]\n",
    "\n",
    "[^1]: $\\varnothing$(파이)는 그리스 문자의 소문자 중 하나다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "여러 개의 집합 $A,\\ B,\\ C,\\ \\cdots$에 포함되는 원소를 모두 모아 놓은 집합을 **합집합**, 혹은 **합병집합**이라 하며, 다음 기호로 표기한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "A\\ \\cup B\\ \\cup C\\ \\cdots\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "마찬가지로 여러 개의 집합 $A,\\ B,\\ C,\\ \\cdots$에 모두 포함되는 원소만을 모아 놓은 집합을 **교집합** 또는 **공통집합**이라 하며, 다음 기호로 표기한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "A\\ \\cap B\\ \\cap C\\ \\cap \\cdots\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "집합이 두 개인 경우를 **벤다이어그램**으로 표현해보면 그림 1-6과 같다. 또한, 집합이 세 개인 경우를 벤다이어그램으로 그려보면 합집합과 교집합의 연산은 다음의 분배법칙을 만족하는 것을 알 수 있다(그림 1-7)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**그림 1-6** 합집합과 교집합"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**그림 1-7** 집합 연산의 분배법칙"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "(A\\ \\cup\\ B)\\ \\cap\\ C = (A\\ \\cap\\ C)\\ \\cup\\ (B\\ \\cup\\ C)\\tag{1-4}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "(A\\ \\cap\\ B)\\ \\cup\\ C = (A\\ \\cup\\ C) \\cap\\ (B\\ \\cup\\ C)\\tag{1-5}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "다음으로 합집합과 교집합은 무한개의 집합에 대해서도 계산할 수 있다는 사실에 주목해보자. 예를 들어 $n = 1,\\ 2,\\ \\cdots$에 대해 집합 $A_n$을 다음과 같이 정의한다."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$$\n",
    "A_n = \\{x\\ |\\ x \\in \\textbf{R}, |x| \\leq 1 + \\frac{1}{n}\\}\n",
    "$$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
